AntonG97/st7789vw-gd32-driver/src/sku22632.c
/* 
Replace this file with your code. Put your source files in this directory and any libraries in the lib folder. 
If your main program should be assembly-language replace this file with main.S instead.

Libraries (other than vendor SDK and gcc libraries) must have .h-files in /lib/[library name]/include/ and .c-files in /lib/[library name]/src/ to be included automatically.
*/

#include "gd32vf103.h"
#include "../include/sku22632.h"
#include "../include/lcd_font.h"

typedef enum{
	SWRESET = 0x01,	//SW reset
	SLPIN = 0x10,	//LCD power saving mode
	SLPOUT = 0x11, 	//LCD turn off power saving mode
	NORON = 0x13,	//Normal display mode on
	INVOFF = 0x20, 	//Display inversion off
	INVON = 0x21,	//Display inversion on
	GAMSET = 0x26,	//Gamma set
	DISPOFF = 0x28,	//Display OFF
	DISPON = 0x29, 	//Display ON
	CASET = 0x2A,	//Column adress set + 4 bytes of data
	RASET = 0x2B,	//Row adress set + 4 bytes of data
	RAMWR = 0x2C, 	//Memory write. Transfer data from MCU to frame mem. When cmd accepted, col and page set to start pos
	MADCTL = 0x36,	//Memory data access control
	COLMOD = 0x3A,	//Interface pixel format
	WRDISBV = 0x51,	//Write display brightness + 1 byte (0x00 => Lowest 0xFF => Highest)
}cmd;

static void lcd_dma_init(uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _spi_perpih);
static void dma_prep_on(uint32_t number);
static void dma_prep_off(void);

static void lcd_wr_data(const uint8_t data);
static void lcd_wr_cmd(const cmd data);
static void lcd_queue_flush_blocking(void);
static void setWindow(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye);
static void fillWindow(const uint16_t xs, const uint16_t xe, const uint16_t ys, const uint16_t ye, color color);

//Auxillery functions
static void delay_ms(uint16_t ms);

/**
 * SPI base
 */
static uint32_t spi_perpih;
/**
 * DMA base
 */
static uint32_t dma_periph;
/**
 * DMA channel
 */
static dma_channel_enum dma_channel;

/**
 * GPIO base
 */
static uint32_t gpio_perpih;

/**
 * Reset GPIO pin. Active LOW.
 */
static uint32_t rst;

/**
 * Chip select GPIO pin. Active LOW. 
 */
static uint32_t cs;

/**
 * Data/Command selection GPIO pin. 
 * LOW => Cmd
 * HIGH => Data
 */
static uint32_t dc;

/**
 * Variable holds the current background color set during previous call of lcd_clear()
 */
static color curr_backgr;

int main(void){

	lcd_init(SPI0, DMA0, DMA_CH2, GPIOA, GPIO_PIN_5, GPIO_PIN_7, GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3);
	//lcd_showPicture(kub_map_v4);

	const color color_list[] = {
    WHITE, BLACK, RED, GREEN, BLUE,
    YELLOW, CYAN, MAGENTA, BROWN, BRRED,
    GRAY, DARKBLUE, LIGHTBLUE, GRAYBLUE,
    LIGHTGREEN, LGRAY, DGRAY, LGRAYBLUE,
    LBBLUE, BRED, GRED, GBLUE
	};

	//setWindow(0, LCD_X_MAX, 0, LCD_Y_MAX);				//Set window
	//lcd_queue_flush_blocking();

	const int color_count = sizeof(color_list) / sizeof(color_list[0]);

	//delay_ms(1000);
	lcd_dma_clear(GREEN);
	//lcd_queue_flush_blocking();
	//delay_ms(2000);
	
	
	while(1){
		//lcd_queue_flush();
		//lcd_drawCircle_filled(120,120,20, BLACK);
		//lcd_dma_clear(BLUE);


		/*
		for (int i = 0; i < color_count; i++) {
		lcd_dma_clear(color_list[i]);
		delay_ms(1000);
		}
		*/
	}
	return 0;
}



/**
 * @brief Delays (blocking)
 * @param[in] ms: Amount of ms to delay
 */
static void delay_ms(uint16_t ms){
	volatile long long base = 7200; 	//Base
	base = base*(long long)ms;			//Mult base with ms
	while(--base) __asm__ volatile("nop");
}
static inline void dc_set(void) {
    gpio_bit_set(gpio_perpih, dc);
}

static inline void dc_clr(void) {
    gpio_bit_reset(gpio_perpih, dc);
}

static inline void cs_set(void) {
    gpio_bit_set(gpio_perpih, cs);
}

static inline void cs_clr(void) {
    gpio_bit_reset(gpio_perpih, cs);
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//DMA functions begin 


//TODO:
	//Måste dela upp!
	//1 funktion som används av ALLA funktioner! Vad för argument delar 
	//enums för kommandon



//Place calls in buffer, handle when able. Use a buffer (takes function pointer (must be same type!))
//Buffer to store function calls
//DMA interrupt when finished

//Down to up:
	//Command OR data? Set / Reset DC (function pointer!!!!)
		//Command:
			//Data command (enum)
				//Set SPI to write CMD <1 byte>
		//Data:
			//Coordinates. Antingen Samma (cirkel) eller olika
			//Color
			//what type? Ex. Str or Ch or Circle? Extra argument! Stösta Str: 16 eller 17 chars

/**
 * What the data is used to draw / write on LCD
 * CIRCLE
 * RECTANGLE
 * NUMBER
 * TEXT
 */
/*
typedef enum{
	CIRCLE = 0,
	RECTANGLE,
	NUMBER,
	TEXT
}data_type;
*/
/**
 * If geomitry figure is filled or hollow
 * FILLED
 * HOLLOW
 */
/*
typedef enum{
	FILLED = 0,
	HOLLOW
}draw_type;
*/
/**
 * If number is integer or float type
 * INTEGER
 * FLOAT
 */
/*
typedef enum{
	INTEGER = 0,
	FLOAT
}numb_type;
*/
/**
 * If single character or string
 * CHAR
 * STRING
 */
/*
typedef enum{
	CHAR = 0,
	STRING,
}text_type;
*/
/**
 * Circle Struct
 * x: Center x coordiante
 * y: center y coordinate
 * r: radie
 */
/*
typedef struct{
	const draw_type type;
	const uint16_t x;
	const uint16_t y;
	const uint16_t r;
	const color color;
}circle_t;
*/
/**
 * Rectangle struct
 */
/*
typedef struct{
	const draw_type type;
	const uint16_t xs;
	const uint16_t xe;
	const uint16_t ys;
	const uint16_t ye;
	color color;
}rect_t;
*/
/**
 * Number struct
 */
/*
typedef struct{
	const numb_type type;
	const uint16_t x;
	const uint16_t y;
	const union{
		int i;
		float f;
	}val;
	const color _color;
	const font_size size;
}numb_t;

#define STR_MAX_SIZE 16
typedef struct{
	const text_type type;
	const uint16_t x;
	const uint16_t y;
	const union{
		uint8_t ch;
		uint8_t str[STR_MAX_SIZE];
	}val;
	const color color;
	const font_size size;
}text_t;
*/

/**
 * LCD command
 */
/*
typedef struct{
	const uint16_t command;
}dma_spi_cmd_t;
*/
/**
 * LCD data
 */
/*
typedef struct{
	data_type type;				//What kind of object
	const union{
		circle_t circle;
		rect_t rect;
		numb_t numb;
		text_t text;
	}object;
}dma_spi_data_t;
*/
/**
 * What kind of type the command is
 */
/*
typedef enum{
	DATA = 0,
	CMD
}dma_spi_type;
*/
/**
 * Struct used by buffer to store function calls if DMA is occupied.
 */
/*
typedef struct{
	dma_spi_type type;			//What kind of information. Command or data
	union{
		uint16_t command;		//Command
		dma_spi_data_t data;	//Data
	}dma_spi_payload;
}dma_spi_t;

