AntonG97/st7789vw-gd32-driver/src/sku22632.c
#define DMA_BUFF_SIZE 512
static dma_spi_t dma_spi_buffer[DMA_BUFF_SIZE] = {0};
int dma_tail = 0, dma_head = 0;
*/
/**
 * @brief Writes data to SPI buffer to be sent
 * @param[in] data: Data to be written by SPI
 */
/*
static void dma_lcd_wr(const dma_spi_t data){
	while(((dma_head + 1) & (DMA_BUFF_SIZE - 1)) == dma_tail) lcd_queue_flush(); //Flush buff if FULL
	dma_spi_buffer[dma_head] = data;									//Add data to buffer
	dma_head = (dma_head + 1) & (DMA_BUFF_SIZE - 1);		//Inrement and wrap head. (BUFF_SIZE - 1 = bitmask of 1's)
}
*/

//Enable SPI interrupt as well!

/**
 * DMA0 channel 2 ISR
 */
/*
void DMA0_Channel2_IRQHandler(void) {
    //Clear flags (IF and FULL SEND)
	//Check what flag. FULL SEND
	//Check if buffer empty?
		//NO: set cs LOW, get next data from buffer & check type (conf DC), config DMA and send data (set amount of data to be sent!)
		//YES: Set CS high

	//Previous type transmitted by DMA
	static dma_spi_type prev_type;


	if( dma_flag_get(dma_periph, dma_channel, DMA_FLAG_FTF) ){
		dma_flag_clear(dma_periph, dma_channel, DMA_FLAG_FTF);				//clear full transfer flag

		if( dma_head != dma_tail ){											//Buffer is NOT empty
			cs_clr();	//Activate LCD

			if( dma_spi_buffer[dma_tail].type != prev_type){				
				dma_spi_buffer[tail].type == DATA ? dc_set() : dc_clr();	//Data or cmd
				prev_type = dma_spi_buffer[tail].type;
			}

			if( dma_spi_buffer[dma_tail].type == DATA ){
				dma_data = (uint16_t)dma_spi_buffer[tail].;
				dma_transfer_number_config(dma_periph, dma_channel, number); // Send 3 transfers

				switch( dma_spi_buffer[tail].dma_spi_payload.data.type ){	 //Get object type!
					case CIRCLE:
					case RECTANGLE:
					case NUMBER:
					case TEXT:
				}


			}else{
				dma_data = dma_spi_buffer[tail].dma_spi_payload.command;
				dma_transfer_number_config(dma_periph, dma_channel, 1); //Send 1 transfer (command)
			}

		}else{	
			cs_set();	//De-activate LCD
		}
	}
	
}
*/

/**
 * @brief Write LCD command
 * @param[in]: Data to be transmitted
 */
/*
static void dma_lcd_wr_cmd(const cmd data){
	//spi_data _data = {0, (uint8_t)data};
	//dma_lcd_wr(_data);
}
*/
/**
 * @brief Write LCD data
 * @param[in]: Data to be transmitted
 */
/*
static void dma_lcd_wr_data(const uint8_t data){
	//spi_data _data = {1, data};
	//lcd_wr(_data);
}
	*/


/**
 * LCD data buffer. Fill with pixel value and let DMA transmit to SPI
 */
static uint16_t dma_data;

/**
 * @brief Initialises DMA pherip and channel used by LCD
 * @param[in]: _dma_periph: DMAx(x=0,1)
 * @param[in]: _channel: specify which DMA channel is initialized only one parameter can be selected => 
 * 				DMA0: DMA_CHx(x=0..6), DMA1: DMA_CHx(x=0..4)
 * @param[in]: _spi_periph: SPIx(x=0,1,2).
 */
static void lcd_dma_init(uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _spi_perpih){
	
	rcu_periph_clock_enable(RCU_DMA0);

	dma_periph = _dma_periph;
	dma_channel = _channel;
	dma_channel_disable(dma_periph, dma_channel);


	/**
	 * Initilise dma parameters
	 */
	dma_parameter_struct dma_init_struct;
	dma_struct_para_init(&dma_init_struct);

	//FIX: memory_addr, number
	dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL; 
	dma_init_struct.memory_addr = (uint32_t)&dma_data; 
	dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_DISABLE; 
	dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT; 			//Buffer 8 bits of data / transfer
	//dma_init_struct.number = (LCD_X_MAX * LCD_Y_MAX) << 1; 			//2 bytes per pixel. There are 240x240 pixels
	dma_init_struct.periph_addr = (uint32_t)((_spi_perpih) + 0x0CU);
	dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE; 
	dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT; 		//SPIx 8 bit data
	dma_init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;				//Highest prio

	//dma_circulation_enable(dma_periph, dma_channel);

	dma_interrupt_enable(DMA0, DMA_CH2, DMA_INT_FTF); 
	//eclic_priority_group_set(ECLIC_PRIGROUP_LEVEL3_PRIO1); 
	eclic_irq_enable(DMA0_Channel2_IRQn, 1, 1);
	eclic_global_interrupt_enable(); 
	dma_init(dma_periph, dma_channel, &dma_init_struct);
}

/**
 * @brief Preps DMA and SPI for transfer
 * @param[in]: number: Total amount of transfers.
 */
static void dma_prep_on(uint32_t number){
	
	//dma_flag_clear(dma_periph, dma_channel, DMA_FLAG_FTF);				//clear full transfer flag

	//Turn off SPI and DMA for config
	spi_dma_disable(spi_perpih, SPI_DMA_TRANSMIT);
	dma_channel_disable(dma_periph, dma_channel);
	
	//Set SPI 16-bit data format
	spi_i2s_data_frame_format_config(spi_perpih, SPI_FRAMESIZE_16BIT);
	//Set number of DMA transfers
	dma_transfer_number_config(dma_periph, dma_channel, number); // Send 3 transfers
	
	//Activate SPI and DMA
	dma_channel_enable(dma_periph, dma_channel);
	spi_dma_enable(spi_perpih, SPI_DMA_TRANSMIT);
}

static void dma_prep_off(void){
	while ( !dma_flag_get(dma_periph, dma_channel, DMA_FLAG_FTF) );
	
	//Turn off SPI and DMA to config back to original settings
	spi_dma_disable(spi_perpih, SPI_DMA_TRANSMIT);				
	dma_channel_disable(dma_periph, dma_channel);						
	spi_i2s_data_frame_format_config(spi_perpih, SPI_FRAMESIZE_8BIT);	//Reset to 8-bit SPI data
	
	cs_set();															//Disable LCD chip
}
//DMA functions end 
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//SPI functions begin
#define BUFF_SIZE 512
/**
 * Struct for SPI data
 * @param type: Kind of data. 0 = cmd and 1 = data
 * @param data: Data to be sent
 */
typedef struct{
	//0 = cmd, 1 = data
	uint8_t type;
	uint8_t data;
}spi_data;

/*
 * Spi data buffer
 */
spi_data buff[BUFF_SIZE] = {0};
int tail = 0, head = 0;

/**
 * @brief initialises LCD. OBS
 * @param[in]: spi_periph: SPIx(x=0,1,2)
 * @param[in]: _dma_periph: DMAx(x=0,1)
 * @param[in]: _channel: specify which DMA channel is initialized only one parameter can be selected => DMA0: DMA_CHx(x=0..6), DMA1: DMA_CHx(x=0..4)
 * @param[in]: gpio_periph: GPIOx(x = A,B,C,D,E). OBS! Once chosen, base all GPIO pins on input param!
 * @param[in]: clk: SPI clock pin
 * @param[in]: din: SPI data out (MOSI)
 * @param[in]: rst: Reset => GPIO_PIN_x(x=0..15) 
 * @param[in]: cs: Chip select => GPIO_PIN_x(x=0..15)
 * @param[in]: dc: Data or cmd => GPIO_PIN_x(x=0..15)
 */
void lcd_init(uint32_t _spi_perpih, uint32_t _dma_periph, dma_channel_enum _channel, uint32_t _gpio_perpih, uint32_t _clk, uint32_t _din, uint32_t _rst, uint32_t _cs, uint32_t _dc){
	spi_perpih = _spi_perpih;
	gpio_perpih = _gpio_perpih;
	rst = _rst;
	cs = _cs;
	dc = _dc;

	lcd_dma_init(_dma_periph, _channel, spi_perpih);

	/**
	 * Init RCU for SPI and GPIO
	 */
	switch(gpio_perpih){
		case GPIOA: rcu_periph_clock_enable(RCU_GPIOA); break;
		case GPIOB: rcu_periph_clock_enable(RCU_GPIOB); break;
		case GPIOC: rcu_periph_clock_enable(RCU_GPIOC); break;
		case GPIOD: rcu_periph_clock_enable(RCU_GPIOD); break;
		case GPIOE: rcu_periph_clock_enable(RCU_GPIOE); break;
	}
	switch(spi_perpih){
		case SPI0: rcu_periph_clock_enable(RCU_SPI0); break;
		case SPI1: rcu_periph_clock_enable(RCU_SPI1); break;
		case SPI2: rcu_periph_clock_enable(RCU_SPI2); break;
	}

	/**
	 * Init GPIO
	 */
	//clk
	gpio_init(gpio_perpih, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, _clk);
	//din (MOSI)
	gpio_init(gpio_perpih, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, _din);
	//rst
	gpio_init(gpio_perpih, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, rst);
	gpio_bit_set(gpio_perpih, rst);
	//cs
	gpio_init(gpio_perpih, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, cs);
	gpio_bit_set(gpio_perpih, cs);
	//dc
	gpio_init(gpio_perpih, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, dc);
	//gpio_bit_set(gpio_perpih, dc);

	/**
	 * Init SPI As Master, 8 bit frame size, little endian and f = 27MHz
	 */
	spi_parameter_struct spi_param;

	spi_struct_para_init(&spi_param);
	spi_param.device_mode = SPI_MASTER;
	spi_param.trans_mode = SPI_TRANSMODE_BDTRANSMIT;
	spi_param.frame_size = SPI_FRAMESIZE_8BIT;
	spi_param.nss = SPI_NSS_SOFT;
	spi_param.endian = SPI_ENDIAN_MSB;
	spi_param.clock_polarity_phase= SPI_CK_PL_LOW_PH_1EDGE;
	spi_param.prescale = SPI_PSC_4;	//TODO: Change later to higher!


	//Init spi
	spi_init(spi_perpih, &spi_param);
	
	/**
	 * Enable SPI
	 */
	spi_enable(spi_perpih);

	
	//HW reset (Reset low for 10-20ms)
	gpio_bit_reset(gpio_perpih, rst);
	delay_ms(40);
	gpio_bit_set(gpio_perpih, rst);

	
	//SW reset (CMD: 0x01, wait 120ms)
	lcd_wr_cmd(SWRESET);
	lcd_queue_flush_blocking();
	delay_ms(130);

	//Sleep out
	lcd_wr_cmd(SLPOUT);
	lcd_queue_flush_blocking();
	delay_ms(130);

